Revit 2026 API

# TemperatureRatingTypeIsInUse Property

---

Indicate whether the temperature rating type is in use.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsInUse { get; }
```
```vb
Public ReadOnly Property IsInUse As Boolean
	Get
```
```cpp
public:
property bool IsInUse {
	bool get ();
}
```
```fsharp
member IsInUse : bool with get
```

#### Property Value

Boolean

#### Reference

TemperatureRatingType Class

Autodesk.Revit.DB.Electrical Namespace